#	Циклы и последовательности. Кодстайл.
-	Циклы и последовательности без массивов. 
	-	for, while.
	-	Замена всех отрицательных чисел положительными, равными им по модулям.
	-	Поиск количества чётных и нечётных.
- 	Стиль кода. 
	- 	Выбор имен переменных (осмысленность, слишком длинные или слишком короткие имена, венгерская нотация). 
	-	 Комментарии. 
	-	 Форматирование (разные стили: пробелы и табуляции).
	-	 Константы.

##	Циклы и последовательности без массивов. 
###	while, for.

В С++ существует два основных вида циклов, самый простой для начала изучения - это `while`.

	while(true)
	{
		//вечный цикл
	}

Цикл `while` работает очень схоже с `if`. Исключением является только то, что тело цикла будет исполняться **пока** условие в круглых скобках -- истинно.

После того, как исполнение доходит до "нижней" строчки программа начнёт исполнять тело цикла с самого начала.

	int x = 2;
	
	while(x >= 0)
	{
		x--;
		cout << x;
	}

|Номер итерации|X|Вывод программы|
|:---:|:---:|:---:|
|0|2|1|
|1|1|0|
|2|0|-1|

После выполнения цикла значение `X` будет равно `-1`. 

Давайте разберём ещё один цикл - `for`.
Его отличие от `while` состоит в том, что он имеет фиксированное число итераций. Использование такого цикла позволяет проходить по элементам массивов, последовательностей, чей размер известен к началу цикла.

	for(блок инициализации; блок условия; блок действия)
	{
		//тело цикла
	}

Логика работы очень проста - при входе в цикл выполняется блок инициализации (**один** раз), потом идёт проверка условия, если оно истино, то идёт выполнение тела цикла, после которого выполняется блок действия.

	for(int i = 0; i < 4; ++i)
	{
		cout << i << " ";//будет выведено 0 1 2 3
	}

###	Замена всех отрицательных чисел положительными, равными им по модулям.

Рассмотрим пример простейших задач, которые можно решить с использованием циклов.

Условие: На вход подаётся последовательность целых чисел, оканчивающаяся нулём (не является членом последовательности). Необходимо заменить все отрицательные числа положительные, равные по модулю, и вывести изменённую последовательность.

	int a;// a - переменная обозначающая текущий член последовательности.
	cin >> a;
	while(a != 0)
	{
		if(a < 0)
		{
			a *= -1;
		}
		cout << a;
		cin >> a;
	}

|Входные данные|Выходные данные|
|:---:|:---:|
|1 0|1|
|1 -2 -3 -5 6 -123 0|1 2 3 5 6 123|

###	Поиск количества чётных и нечётных.

Условие: На вход подаётся число *n* - количество членов последовательности. Далее идут *n* целых чисел. Необходимо вывести количество чётных и нечётных чисел через пробел.

	int a, n;// a - переменная обозначающая текущий член последовательности, n - перемнная обозначающая длину последовательности.
	int countEvent = n, countOdd = 0;// переменные для подсчёта чётных и нечётных чисел.
	cin >> n;
	for(int i = 0; i < n; ++i)
	{
		cin >> a;
		countOdd += a % 2;
	}
	countEven -= countOdd;
	cout << countEven << " " << countOdd;

|Входные данные|Выходные данные|
|:---:|:---:|
|1 0|1 0|
|6 1 -2 -3 -5 6 -123|2 4|


## 	Стиль кода. 

### 	Выбор имен переменных (осмысленность, слишком длинные или слишком короткие имена, венгерская нотация). 

###	 Комментарии. 

###	 Форматирование (разные стили: пробелы и табуляции).

###	 Константы.

