

#	Циклы и последовательности. Кодстайл.


[TOC]


##	Циклы и последовательности без массивов. 
###	while, for.

В С++ существует два основных вида циклов, самый простой для начала изучения - это `while`.

```c++
while(true)
{
//вечный цикл
}
```

Цикл `while` работает очень схоже с `if`. Исключением является только то, что тело цикла будет исполняться **пока** условие в круглых скобках -- истинно.

После того, как исполнение доходит до "нижней" строчки программа начнёт исполнять тело цикла с самого начала.

```c++
int x = 2;

while(x >= 0)
{
x--;
cout << x;
}
```

|Номер итерации|X|Вывод программы|
|:---:|:---:|:---:|
|0|2|1|
|1|1|0|
|2|0|-1|

После выполнения цикла значение `X` будет равно `-1`. 

Давайте разберём ещё один цикл - `for`.
Его отличие от `while` состоит в том, что он имеет фиксированное число итераций. Использование такого цикла позволяет проходить по элементам массивов, последовательностей, чей размер известен к началу цикла.

```C++
for(блок инициализации; блок условия; блок действия)
{
//тело цикла
}
```

Логика работы очень проста - при входе в цикл выполняется блок инициализации (**один** раз), потом идёт проверка условия, если оно истино, то идёт выполнение тела цикла, после которого выполняется блок действия.

```c++
for(int i = 0; i < 4; ++i)
{
cout << i << " ";//будет выведено 0 1 2 3
}
```

###	Замена всех отрицательных чисел положительными, равными им по модулям.

Рассмотрим пример простейших задач, которые можно решить с использованием циклов.

Условие: На вход подаётся последовательность целых чисел, оканчивающаяся нулём (не является членом последовательности). Необходимо заменить все отрицательные числа положительные, равные по модулю, и вывести изменённую последовательность.

```c++
int a;// a - переменная обозначающая текущий член последовательности.
cin >> a;
while(a != 0)
{
if(a < 0)
{
a *= -1;
}
cout << a;
cin >> a;
}
```

|Входные данные|Выходные данные|
|:---:|:---:|
|1 0|1|
|1 -2 -3 -5 6 -123 0|1 2 3 5 6 123|

###	Поиск количества чётных и нечётных.

Условие: На вход подаётся число *n* - количество членов последовательности. Далее идут *n* целых чисел. Необходимо вывести количество чётных и нечётных чисел через пробел.

```C++
int a, n;// a - переменная обозначающая текущий член последовательности, n - перемнная обозначающая длину последовательности.
int countEvent, countOdd = 0;// переменные для подсчёта чётных и нечётных чисел.
cin >> n;
countEvent = n;
for(int i = 0; i < n; ++i)
{
cin >> a;
countOdd += a % 2;
}
countEven -= countOdd;
cout << countEven << " " << countOdd;
```

|Входные данные|Выходные данные|
|:---:|:---:|
|1 0|1 0|
|6 1 -2 -3 -5 6 -123|2 4|

### break; continue;

Для более удобной работы с циклами существуют `break` и `continue`. Это ключевые слова, которые позволяют прервать выполнение всего цикла или итерации.

```c++
for(int i = 0; i < 10; ++i)
{
	if(i < 5)
	{
		continue;
	}
	if(i == 9)
	{
		break;
	}
	cout << i << " ";
	// Сюда переходит программа после выполнения continue;
}
// Сюда он попадёт если будет выполнен break;
```
Программа выведет `5 6 7 8`

##	Стиль кода. 

В этой части лекции мы попробуем дать рекомендации по оформлению кода в процессе разработки. Подразумевается, что следование этим рекомендациям поможет вам быстрее разрабатывать ПО, и другим людям понимать смысл написанного.

Основная цель рекомендаций — улучшение читаемости и, следовательно, ясности и лёгкости поддержки, а также общего качества кода. Невозможно дать рекомендации на все случаи жизни, поэтому программист должен мыслить гибко.

Новички и неопытные программисты обычно используют рекомендации по стилю для лучшего понимания жаргона программистов.

### 	Выбор имен переменных. 

***ВСЕГДА*** названия переменных должны быть** говорящими**. Не имеет значения решаете вы простую задачу или реализуете протокол обмена информацией между спутниками. Человек, который знает, какую задачу вы решаете, должен только по названию переменных свободно ориентироваться в коде.

На этом кружке от вас **требуется** использовать при именовании переменных, функций, классов CamelCase.

```c++
string getName();//это функция
string ownerName = "Vasya";//это переменная
class Owner//это класс
{

};
```

Названия методов и функций должны быть **глаголами**, быть записанными в смешанном регистре и начинаться с нижнего.

```c++
string getName();
double computeAverageValue();
bool isEven();
```

***Все имена следует записывать по-английски.***

Переменные, имеющие большую область видимости, следует называть более длинными именами, имеющие небольшую область видимости - короткими.

Имена временных переменных, использующихся для хранения временных значений или индексов, лучше всего делать короткими. Программист, читающий такие переменные, должен иметь возможность предположить, что их значения не используются за пределами нескольких строк кода. **Обычно это переменные i, j, k(используются преимущественно в циклах), l, m, n (для целых), а также c и d (для символов)**.

Префикс is **необходимо** использовать только для булевых (логических) переменных и методов.

```c++
bool isSet, isVisible, isFinished, isFound, isOpen;
// Использование этого префикса избавляет от таких имён,
// как status или flag. isStatus или isFlag просто
// не подходят, и программист вынужден
// выбирать более осмысленные имена.
```

###	 Комментарии. 

Сложный код, написанный с использованием хитрых ходов, следует не комментировать, а **переписывать!**

Следует делать как можно **меньше** комментариев, делая код самодокументируемым путём выбора правильных имён и создания ясной логической структуры.

***Все комментарии следует писать на английском***.

Используйте `//` для всех комментариев, включая многострочные.

Если следовать этой рекомендации, многострочные комментарии `/* */` можно использовать для отладки и иных целей. После `//` следует ставить `пробел`, а сам комментарий следует начинать писать с большой буквы завершать точкой.

###	 Форматирование.

Основной отступ следует делать в четыре пробела (1 tab).

```c++
for (int i = 0; i < nElements; i++)
{
	a[i] = 0;
}
```

Отступ в один пробел достаточно мал, чтобы отражать логическую структуру кода. Отступ более 4 пробелов делает глубоко вложенный код нечитаемым и увеличивает вероятность того, что строки придётся разбивать. Широко распространены варианты в 2, 3 или 4 пробела; причём 2 и 4 — более широко.

Блоки кода могут быть оформлены 2-мя способами.

```c++
//Первый
while (!done)
{
	doSomething();
	done = moreToDo();
}
//Второй
while (!done) {
	doSomething();
	done = moreToDo();
}
```

- Операторы следует отбивать пробелами.
- После зарезервированных ключевых слов языка C++ следует ставить пробел.
- После запятых следует ставить пробелы.
- Двоеточия следует отбивать пробелами.
- После точек с запятой в цикле for следует ставить пробелы.
- Логические блоки в коде следует отделять пустой строкой.

###	 Константы.

**Любые** константы оформляются вернхим регистром, слова разделяются нижними подчёркиваниями.

```c++
int PI = 3;
double EARTH_RADIUS = 6371;
double CAT_WEIGHT = 4.1;
```

Разберём на [примере](https://habr.com/ru/post/458264/)